// src/chatbot/hangmanWords.js
export const hangmanWords = [
  // مفاهیم پایه
  "الگوریتم",
  "کدگذاری",
  "دیباگ",
  "متغیر",
  "تابع",
  "کلاس",
  "شیء",
  "آرایه",
  "رکورد",
  "ماژول",

  // زبان‌ها و تکنولوژی‌ها
  "پایتون",
  "جاوا",
  "جاوااسکریپت",
  "سیشارپ",
  "ری‌اکت",
  "اکسپرس",
  "انگولار",
  "دات‌نت",
  "گولنگ",

  // ابزارها و مفاهیم نرم‌افزاری
  "گیت",
  "داکر",
  "کوبرنیتس",
  "فریمورک",
  "کتابخانه",
  "سرور",
  "کلاینت",
  "دیتابیس",
  "ریکوئست",

  // الگوریتم و داده
  "پشته",
  "باینری",
  "هیپ",
  "مرج",
  "دایکسترا",
  "کوئیک",
  "درخت",
  "گراف",
];
